// const encode2 = input =>
//     [...input]
//         .map((x, i) => [x.charCodeAt(0), i])
//         .sort()
//         .flatMap(x => x)
//         .join(".")
//         .match(/./g)
//         .flatMap((x, i) =>
//             new Array(x == "." ? 1 : 2 + x * 2).fill((1 + i) % 2)
//         )
//         .join("")
//         /**
//          * регулярное выражение ищет послеовательность нулей и единиц
//          * т.е. последовательность, где 0 или 1 повторяются 1 и более раз
//          * например, 0001011 найдёт: [000, 1, 0, 11]
//          */
//         .replace(/(([01])\2*)/g, x => `${+x ? "." : "-"}${x.length}`)

